sdlylshl/Cabinet_ALL/Cabinet_Device/STM32F103VET/Source/System/Timer/timer.h
#ifndef TIME_TEST_H
#define TIME_TEST_H

#include "stm32f10x.h"

extern volatile uint32_t time;
extern volatile uint32_t Zigbee_time;
extern volatile uint32_t Net_time;
extern volatile uint32_t time_out;
extern volatile uint32_t timer_Device_update;
extern volatile uint32_t timer_Zigbee_getStatus;
extern volatile uint32_t timer_Zigbee_getBattery;
extern volatile uint32_t timer_Zigbee_sendBuff;
extern volatile uint32_t timer_Zigbee_ClearRequest;
extern volatile uint32_t timer_Zigbee_operate_default;
extern volatile uint32_t timer_Zigbee_reset_default;
extern volatile uint32_t timer_curtain_stop;
#define START_TIME()  time=0;RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2 , ENABLE);TIM_Cmd(TIM2, ENABLE)
#define STOP_TIME()  TIM_Cmd(TIM2, DISABLE);RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2 , DISABLE)

extern void TIM2_Configuration(void);
extern void TIM2_IRQHandle(void);
#endif	/* TIME_TEST_H */
